---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveIsMultilevel
source: html/d621aead-10a6-d0b8-c999-28948ff1dd15.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveIsMultilevel Property

"Multilevel Boundary"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveIsMultilevel { get; }
```